mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xm/mb9bf56xm.svd
        <!-- REGISTER "WTCR13" -->
        <register>
          <name>WTCR13</name>
          <description>Control Register 13 [BHW]</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTCRIE" -->
            <field>
              <name>INTCRIE</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read completion interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERIE" -->
            <field>
              <name>INTERIE</name>
              <description>Time rewrite error interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALIE" -->
            <field>
              <name>INTALIE</name>
              <description>Alarm coincidence interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMIE" -->
            <field>
              <name>INTTMIE</name>
              <description>Timer underflow interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHIE" -->
            <field>
              <name>INTHIE</name>
              <description>Every hour interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMIE" -->
            <field>
              <name>INTMIE</name>
              <description>Every minute interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSIE" -->
            <field>
              <name>INTSIE</name>
              <description>Every second interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSIE" -->
            <field>
              <name>INTSSIE</name>
              <description>Every 0.5-second interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCR20" -->
        <register>
          <name>WTCR20</name>
          <description>Control Register 20 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PWRITE" -->
            <field>
              <name>PWRITE</name>
              <description>VBAT PORT save control bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PREAD" -->
            <field>
              <name>PREAD</name>
              <description>VBAT PORT recall control bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BWRITE" -->
            <field>
              <name>BWRITE</name>
              <description>Back up register save control bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BREAD" -->
            <field>
              <name>BREAD</name>
              <description>Back up register recall control bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CWRITE" -->
            <field>
              <name>CWRITE</name>
              <description>RTC setting save control bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CREAD" -->
            <field>
              <name>CREAD</name>
              <description>RTC setting recall control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCR21" -->
        <register>
          <name>WTCR21</name>
          <description>Control Register 21 [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMRUN" -->
            <field>
              <name>TMRUN</name>
              <description>Timer counter operation bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMEN" -->
            <field>
              <name>TMEN</name>
              <description>Timer counter control bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMST" -->
            <field>
              <name>TMST</name>
              <description>Timer counter start bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTSR" -->
        <register>
          <name>WTSR</name>
          <description>Second Register [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS" -->
            <field>
              <name>TS</name>
              <description>2nd digit of the second information</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S" -->
            <field>
              <name>S</name>
              <description>1st digit of the second information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTMIR" -->
        <register>
          <name>WTMIR</name>
          <description>Minute Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMI" -->
            <field>
              <name>TMI</name>
              <description>2nd digit of the minute information</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MI" -->
            <field>
              <name>MI</name>
              <description>1st digit of the minute information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTHR" -->
        <register>
          <name>WTHR</name>
          <description>Hour register [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TH" -->
            <field>
              <name>TH</name>
              <description>2nd digit of the hour information</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "H" -->
            <field>
              <name>H</name>
              <description>1st digit of the hour information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDR" -->
        <register>
          <name>WTDR</name>
          <description>Day Register [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TD" -->
            <field>
              <name>TD</name>
              <description>2nd digit of the day information</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>1st digit of the day information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDW" -->
        <register>
          <name>WTDW</name>
          <description>Day of the Week Register [BHW]</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DW" -->
            <field>
              <name>DW</name>
              <description>Day of the week information</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTMOR" -->
        <register>
          <name>WTMOR</name>
          <description>Month Register [BHW]</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMO" -->
            <field>
              <name>TMO</name>
              <description>2nd digit of the month information</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MO" -->
            <field>
              <name>MO</name>
              <description>1st digit of the month information</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
