mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xm/mb9bf56xm.svd
        <!-- REGISTER "BREG16" -->
        <register>
          <name>BREG16</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x116</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG17" -->
        <register>
          <name>BREG17</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x117</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG18" -->
        <register>
          <name>BREG18</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x118</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG19" -->
        <register>
          <name>BREG19</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x119</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1A" -->
        <register>
          <name>BREG1A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x11A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1B" -->
        <register>
          <name>BREG1B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x11B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1C" -->
        <register>
          <name>BREG1C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x11C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1D" -->
        <register>
          <name>BREG1D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x11D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1E" -->
        <register>
          <name>BREG1E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x11E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1F" -->
        <register>
          <name>BREG1F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x11F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG20" -->
        <register>
          <name>BREG20</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x120</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG21" -->
        <register>
          <name>BREG21</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x121</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG22" -->
        <register>
          <name>BREG22</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x122</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG23" -->
        <register>
          <name>BREG23</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x123</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG24" -->
        <register>
          <name>BREG24</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x124</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG25" -->
        <register>
          <name>BREG25</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x125</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG26" -->
        <register>
          <name>BREG26</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x126</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
